<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"azurerm","backend":"83d59cff96d1135e5c2b6d5952288577820b4e62f6f1ea8ea574e9f183b1d41e","plan_job_ref":"Job ci #2166 at https://github.com/acm-uic/acm-uic.github.io/actions/runs/6093694758","plan_hash":"9442d132d133d7e198eee2ebf039c7e4575d556e5f5f91a5eecd2bf6123b06da","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __tf__ in the __prod__ workspace<details open><summary>With variables</summary>

```hcl
typesense_api_key         = (sensitive value)
typesense_collection_name = (sensitive value)
typesense_rg              = "typesense-rg"
```
</details>
<details>
<summary>Plan: 4 to add, 1 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_container_app.typesense_container_app will be created
  + resource "azurerm_container_app" "typesense_container_app" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "typesense-container-app"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "typesense-rg"
      + revision_mode                 = "Single"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8108
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = "one"

          + container {
              + args              = []
              + command           = []
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "docker.io/typesense/typesense:0.24.0"
              + memory            = "2Gi"
              + name              = "typesense-acm-website"

              + env {
                  + name  = "TYPESENSE_DATA_DIR"
                  + value = "/data"
                }
              + env {
                  + name        = "TYPESENSE_API_KEY"
                  + secret_name = "api-key"
                }

              + liveness_probe {
                  + failure_count_threshold          = 3
                  + initial_delay                    = 10
                  + interval_seconds                 = 10
                  + path                             = "/health"
                  + port                             = 8108
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 1
                  + transport                        = "HTTP"
                }

              + readiness_probe {
                  + failure_count_threshold = 3
                  + interval_seconds        = 10
                  + path                    = "/health"
                  + port                    = 8108
                  + success_count_threshold = 3
                  + timeout                 = 1
                  + transport               = "HTTP"
                }

              + volume_mounts {
                  + name = "typesense-volume"
                  + path = "/data"
                }
            }

          + volume {
              + name         = "typesense-volume"
              + storage_name = "typesense-container-app-storage"
              + storage_type = "AzureFile"
            }
        }
    }

  # azurerm_container_app_environment.typesense_container_app_env will be created
  + resource "azurerm_container_app_environment" "typesense_container_app_env" {
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "northcentralus"
      + log_analytics_workspace_id       = "*************************************************************************************************************************************************"
      + name                             = "typesense-container-app-env"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "typesense-rg"
      + static_ip_address                = (known after apply)
    }

  # azurerm_container_app_environment_storage.typesense_container_app_env_storage will be created
  + resource "azurerm_container_app_environment_storage" "typesense_container_app_env_storage" {
      + access_key                   = (sensitive value)
      + access_mode                  = "ReadWrite"
      + account_name                 = "typesensestorage"
      + container_app_environment_id = (known after apply)
      + id                           = (known after apply)
      + name                         = "typesense-container-app-storage"
      + share_name                   = "typesense-share"
    }

  # azurerm_storage_share.typesense_storage_share will be updated in-place
  ~ resource "azurerm_storage_share" "typesense_storage_share" {
        id                   = "https://typesensestorage.file.core.windows.net/typesense-share"
        name                 = "typesense-share"
      ~ quota                = 1024 -> 100
        # (6 unchanged attributes hidden)
    }

  # shell_script.typesense_search_only_api_key will be created
  + resource "shell_script" "typesense_search_only_api_key" {
      + dirty                 = false
      + environment           = (known after apply)
      + id                    = (known after apply)
      + output                = (known after apply)
      + sensitive_environment = (sensitive value)
      + triggers              = {
          + "when_value_changed" = (sensitive value)
        }
      + working_directory     = "."

      + lifecycle_commands {
          + create = <<-EOT
                until curl --silent "https://$TYPESENSE_HOST/health" | grep -q '"ok":true'; do sleep 5; done;
                curl --silent "https://$TYPESENSE_HOST/keys" \
                  -X POST \
                  -H "X-TYPESENSE-API-KEY: $TYPESENSE_API_KEY" \
                  -H 'Content-Type: application/json' \
                  -d "{\"description\":\"search-only-api-key-$COLLECTION_NAME\",\"actions\": [\"documents:search\"], \"collections\": [\"$COLLECTION_NAME\"]}" \
                  | jq '{id, value}'
            EOT
          + delete = <<-EOT
                IN=$(cat)
                ID=$(echo $IN | jq -r .id)
                until curl --silent "https://$TYPESENSE_HOST/health" | grep -q '"ok":true'; do sleep 5; done;
                curl --silent "https://$TYPESENSE_HOST/keys/$ID" \
                  -X DELETE \
                  -H "X-TYPESENSE-API-KEY: $TYPESENSE_API_KEY"
            EOT
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ typesense_container_app_fqdn  = "typesense-container-app.jollyhill-e458c969.northcentralus.azurecontainerapps.io" -> (known after apply)
  ~ typesense_search_only_api_key = "********************************" -> (known after apply)
```
</details>

:memo: Plan generated in [ci #2166](https://github.com/acm-uic/acm-uic.github.io/actions/runs/6093694758)